# ClosedSpline Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SplineFailures..::..ClosedSpline Property
BuiltInFailures..::..SplineFailures Class See Also
---
Closed or self-intersecting splines are not allowed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ClosedSpline { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ClosedSpline As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ClosedSpline {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SplineFailures Class
Autodesk.Revit.DB Namespace